# CylindricalSurface Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalSurface Class
Members See Also
---
A cylindrical surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class CylindricalSurface : Surface
```

Visual Basic
---
```text
Public Class CylindricalSurface _
	Inherits Surface
```

Visual C++
---
```text
public ref class CylindricalSurface : public Surface
```

# Remarks
The parametric equation of the cylinder is S(u, v) = center + radius*cos(u)*xVec + radius*sin(u)*yVec + v*zVec.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Surface Autodesk.Revit.DB..::..CylindricalSurface
# See Also
CylindricalSurface Members
Autodesk.Revit.DB Namespace